# Project 3- Chinook Database and MySql Connector  &
# Chinook Sqlite and Pandas

## Saul Alas-garcia and Ranju Thomas

## Method -1 MySql and Pandas

**We installed chinook database by downloading the mysql script from the chinook/github link and running the sql script on the MySql (our RDBMS is MySql)** <br> <br>

**In order to connect the Anaconda IDE to the MySql we need a middleware or more accurately a connector. We are using the standard MySql connector for python. ** <br><br>

***In order to install the mysql connector from python to mysql we have run a command onn the Anaconda prompt. 
"conda install -c anaconda mysql-connector-python" when this is run on admin mode the conda prompt will install all the neccessary package so we can run the sql query from Jupyter notes through Anaconda. *** <br>

In [14]:
import pandas as pd
import mysql.connector

# open connection to the database  
conn = mysql.connector.connect(host='localhost',  
                       port=3306,  
                       user='root',  
                       passwd='Inr4y00ur299w1',  
                       db='chinook',  
                       charset='utf8')  
cur = conn.cursor() 

sql = '''SELECT cus.LastName, cus.FirstName, trk.Name, alb.Title FROM Customer as cus
         LEFT JOIN Invoice as inv ON cus.CustomerId = inv.CustomerId
         LEFT JOIN InvoiceLine as inl
         ON inv.InvoiceId = inl.InvoiceId
         LEFT JOIN Track as trk
         ON inl.TrackId = trk.TrackId
         LEFT JOIN Album as alb
         ON trk.AlbumId = alb.AlbumId
         ORDER BY cus.LastName, cus.FirstName'''

pd.read_sql(sql, conn).head(5)

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas

## Method-2 Sqlite and Pandas

**Please save the file Chinook_Sqlite.sqlite in the folder :/Data/Chinook/**

In [1]:
import  pandas as pd
import sqlite3

**Creating the connection to sqlite using the the built in sql in python**

In [2]:
con = sqlite3.connect('C:\Data\Chinook\Chinook_Sqlite.sqlite')

**This creates the query that will join 5 different tables that use similar ID numbers, following by the order that it should sort by.**

In [3]:

db = pd.read_sql_query('''SELECT customer.LastName, customer.FirstName, track.Name, album.Title
         FROM customer
         LEFT JOIN invoice
         ON customer.CustomerId = invoice.CustomerId
         LEFT JOIN invoiceline 
         ON invoice.InvoiceId = invoiceline.InvoiceId
         LEFT JOIN track
         ON invoiceline.TrackId = track.TrackId
         LEFT JOIN album
         ON track.AlbumId = album.AlbumId
         ORDER BY customer.LastName, customer.FirstName'''
,con=con)

db.head(5)

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas